Autodesk.Revit.DB.PhaseArray
An array that contains phase objects.

Autodesk.Revit.DB.PhaseArray.Insert(Autodesk.Revit.DB.Phase,System.Int32)
System.Int32
Insert the specified phase into the array.
item: The phase to be inserted into the array.
index: The phase will be inserted before this index.
Returns: Returns whether the phase was inserted into the array.

Autodesk.Revit.DB.PhaseArray.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.PhaseArray.ReverseIterator
Autodesk.Revit.DB.ElementArrayIterator
Retrieve a backward moving iterator to the array.
Returns: Returns a backward moving iterator to the array.

Autodesk.Revit.DB.PhaseArray.ForwardIterator
Autodesk.Revit.DB.ElementArrayIterator
Retrieve a forward moving iterator to the array.
Returns: Returns a forward moving iterator to the array.

Autodesk.Revit.DB.PhaseArray.Append(Autodesk.Revit.DB.Phase)
void
Add the phase to the end of the array.
item: The phase to be added.

Autodesk.Revit.DB.PhaseArray.Clear
void
Removes every phase from the array, rendering it empty.

Autodesk.Revit.DB.PhaseArray.Size
System.Int32
get
Returns the number of phases that are in the array.

Autodesk.Revit.DB.PhaseArray.Item(System.Int32)
Autodesk.Revit.DB.Phase
Gets or sets a phase at a specified index within the array.
index: The index of the phase to be set or retrieved.
Returns: Returns the phase at the specified index.

Autodesk.Revit.DB.PhaseArray.IsEmpty
System.Boolean
get
Test to see if the array is empty.
Remarks: If the array is empty then True will be returned, otherwise False.